FOREIGN_SURNAME_PATTERNS = [
    # prefixes, i.e Сен-Жермен, Мак-Кинли, Тер-Петросян
    [{'ORTH': "Сан"}, {'ORTH': "-"}, {}],
    [{'ORTH': "Сен"}, {'ORTH': "-"}, {}],
    [{'ORTH': "Сент"}, {'ORTH': "-"}, {}],
    [{'ORTH': "Мак"}, {'ORTH': "-"}, {}],
    [{'LOWER': "аль"}, {'ORTH': "-"}, {}],
    [{'ORTH': "Тер"}, {'ORTH': "-"}, {}],
    [{'ORTH': "Бен"}, {'ORTH': "-"}, {}],
    [{'ORTH': "Ибн"}, {'ORTH': "-"}, {}],
    # postfixes, i.e. Бендер-бей, Ахмет-паша
    [{}, {'ORTH': "-"}, {'LOWER': "оглы"}],
    [{}, {'ORTH': "-"}, {'LOWER': "али"}],
    [{}, {'ORTH': "-"}, {'LOWER': "заде"}],
    [{}, {'ORTH': "-"}, {'LOWER': "зуль"}],
    [{}, {'ORTH': "-"}, {'LOWER': "хан"}],
    [{}, {'ORTH': "-"}, {'LOWER': "шах"}],
    [{}, {'ORTH': "-"}, {'LOWER': "кызы"}],
    [{}, {'ORTH': "-"}, {'LOWER': "бей"}],
    [{}, {'ORTH': "-"}, {'LOWER': "бек"}],
    [{}, {'ORTH': "-"}, {'LOWER': "паша"}],
    [{}, {'ORTH': "-"}, {'LOWER': "хан"}],
    [{}, {'ORTH': "-"}, {'LOWER': "ага"}],
]

PRONOUN_PATTERNS = [
    # postfixes, i.e
    [{}, {'ORTH': "-"}, {'ORTH': "либо"}],
    [{}, {'ORTH': "-"}, {'ORTH': "нибудь"}],
    [{}, {'ORTH': "-"}, {'ORTH': "то"}],
    [{}, {'ORTH': "-"}, {'ORTH': "нито"}],
    # prefixes
    [{'LOWER': "кое"}, {'ORTH': "-"}, {}],
    [{'LOWER': "кой"}, {'ORTH': "-"}, {}],
    [{'LOWER': "как"}, {'ORTH': "-"}, {}],
]

PARTICLE_PATTERNS = [
    # i.e Ничего-то ты не знаешь, Джон Сноу.
    [{}, {'ORTH': "-"}, {'ORTH': "де"}],
    [{}, {'ORTH': "-"}, {'ORTH': "ка"}],
    [{}, {'ORTH': "-"}, {'ORTH': "те"}],
    # [{}, {'ORTH': "-"}, {'ORTH': "то"}],
    # [{}, {'ORTH': "-"}, {'ORTH': "с"}],
    [{}, {'ORTH': "-"}, {'ORTH': "таки"}],
    [{'LOWER': 'да'}, {'ORTH': '-'}, {'LOWER': 'да'}],
    [{'LOWER': 'да'}, {'ORTH': '-'}, {'LOWER': 'а'}],
]

INTERJECTIONS_PATTERNS = [
    [{'LOWER': 'э'}, {'ORTH': '-'}, {'LOWER': 'э'}],
    [{'LOWER': 'м'}, {'ORTH': '-'}, {'LOWER': 'м'}],
    [{'LOWER': 'а'}, {'ORTH': '-'}, {'LOWER': 'а'}],
    [{'LOWER': 'ха'}, {'ORTH': '-'}, {'LOWER': 'ха'}, {'ORTH': '-'}, {'LOWER': 'ха'}],
    [{'LOWER': 'ей'}, {'ORTH': '-'}, {'LOWER': 'богу'}],
    [{'LOWER': 'ха'}, {'ORTH': '-'}, {'LOWER': 'ха'}],
    [{'LOWER': 'а'}, {'ORTH': '-'}, {'LOWER': 'а'}, {'ORTH': '-'}, {'LOWER': 'а'}],
    [{'LOWER': 'ну'}, {'ORTH': '-'}, {'LOWER': 'ну'}],
]

ADVERB_PATTERNS = [
    # prefixes
    [{'LOWER': "по"}, {'ORTH': "-"}, {}],
    [{'LOWER': "во"}, {'ORTH': "-"}, {}],
    [{'LOWER': "в"}, {'ORTH': "-"}, {}],
    # full adverbs
    [{'LOWER': 'вверх'}, {'ORTH': '-'}, {'LOWER': 'вниз'}],
    [{'LOWER': 'чуть'}, {'ORTH': '-'}, {'LOWER': 'чуть'}],
    [{'LOWER': 'чуть'}, {'ORTH': '-'}, {'LOWER': 'чуть'}],
    [{'LOWER': 'только'}, {'ORTH': '-'}, {'LOWER': 'только'}],
    [{'LOWER': 'далеко'}, {'ORTH': '-'}, {'LOWER': 'далеко'}],
    [{'LOWER': 'тет'}, {'ORTH': '-'}, {'LOWER': 'а'}, {'ORTH': '-'}, {'LOWER': 'тет'}],
    [{'LOWER': 'вправо'}, {'ORTH': '-'}, {'LOWER': 'влево'}],
    [{'LOWER': 'тю'}, {'ORTH': '-'}, {'LOWER': 'тю'}],
    [{'LOWER': 'плюс'}, {'ORTH': '-'}, {'LOWER': 'минус'}],
    [{'LOWER': 'подобру'}, {'ORTH': '-'}, {'LOWER': 'поздорову'}],
    [{'LOWER': 'любо'}, {'ORTH': '-'}, {'LOWER': 'дорого'}],
    [{'LOWER': 'совсем'}, {'ORTH': '-'}, {'LOWER': 'совсем'}],
    [{'LOWER': 'тихо'}, {'ORTH': '-'}, {'LOWER': 'мирно'}],
    [{'LOWER': 'тьфу'}, {'ORTH': '-'}, {'LOWER': 'тьфу'}],
    [{'LOWER': 'медленно'}, {'ORTH': '-'}, {'LOWER': 'медленно'}],
    [{'LOWER': 'на'}, {'ORTH': '-'}, {'LOWER': 'гора'}],
    [{'LOWER': 'направо'}, {'ORTH': '-'}, {'LOWER': 'налево'}],
    [{'LOWER': 'чего'}, {'ORTH': '-'}, {'LOWER': 'чего'}],
    [{'LOWER': 'полным'}, {'ORTH': '-'}, {'LOWER': 'полно'}],
    [{'LOWER': 'еле'}, {'ORTH': '-'}, {'LOWER': 'еле'}],
    [{'LOWER': 'всего'}, {'ORTH': '-'}, {'LOWER': 'навсего'}],
    [{'LOWER': 'ничего'}, {'ORTH': '-'}, {'LOWER': 'ничего'}],
    [{'LOWER': 'о'}, {'ORTH': '-'}, {'LOWER': 'очень'}],
    [{'LOWER': 'редко'}, {'ORTH': '-'}, {'LOWER': 'редко'}],
    [{'LOWER': 'вперед'}, {'ORTH': '-'}, {'LOWER': 'назад'}],
    [{'LOWER': 'ва'}, {'ORTH': '-'}, {'LOWER': 'банк'}],
    [{'LOWER': 'худо'}, {'ORTH': '-'}, {'LOWER': 'бедно'}],
    [{'LOWER': 'высоко'}, {'ORTH': '-'}, {'LOWER': 'высоко'}],
    [{'LOWER': 'оч'}, {'ORTH': '-'}, {'LOWER': 'чень'}],
    [{'LOWER': 'все'}, {'ORTH': '-'}, {'LOWER': 'все'}, {'ORTH': '-'}, {'LOWER': 'все'}],
    [{'LOWER': 'нежданно'}, {'ORTH': '-'}, {'LOWER': 'негаданно'}],
    [{'LOWER': 'тихо'}, {'ORTH': '-'}, {'LOWER': 'тихо'}],
    [{'LOWER': 'мелко'}, {'ORTH': '-'}, {'LOWER': 'мелко'}],
    [{'LOWER': 'сегодня'}, {'ORTH': '-'}, {'LOWER': 'завтра'}],
    [{'LOWER': 'давным'}, {'ORTH': '-'}, {'LOWER': 'давно'}],
    [{'LOWER': 'мало'}, {'ORTH': '-'}, {'LOWER': 'помалу'}],
    [{'LOWER': 'мало'}, {'ORTH': '-'}, {'LOWER': 'мальски'}],
    [{'LOWER': 'ого'}, {'ORTH': '-'}, {'LOWER': 'го'}],
    [{'LOWER': 'едва'}, {'ORTH': '-'}, {'LOWER': 'едва'}],
    [{'LOWER': 'давно'}, {'ORTH': '-'}, {'LOWER': 'давно'}],
    [{'LOWER': 'крепко'}, {'ORTH': '-'}, {'LOWER': 'крепко'}],
    [{'LOWER': 'вот'}, {'ORTH': '-'}, {'LOWER': 'вот'}],
    [{'LOWER': 'волей'}, {'ORTH': '-'}, {'LOWER': 'неволей'}],
    [{'LOWER': 'завтра'}, {'ORTH': '-'}, {'LOWER': 'послезавтра'}],
    [{'LOWER': 'более'}, {'ORTH': '-'}, {'LOWER': 'менее'}],
    [{'LOWER': 'постольку'}, {'ORTH': '-'}, {'LOWER': 'поскольку'}],
    [{'LOWER': 'точь'}, {'ORTH': '-'}, {'LOWER': 'в'}, {'ORTH': '-'}, {'LOWER': 'точь'}],
    [{'LOWER': 'быстро'}, {'ORTH': '-'}, {'LOWER': 'быстро'}],
    [{'LOWER': 'все'}, {'ORTH': '-'}, {'LOWER': 'все'}],
    [{'LOWER': 'шаляй'}, {'ORTH': '-'}, {'LOWER': 'валяй'}],
    [{'LOWER': 'взад'}, {'ORTH': '-'}, {'LOWER': 'вперед'}],
    [{'LOWER': 'очень'}, {'ORTH': '-'}, {'LOWER': 'очень'}],
    [{'LOWER': 'просто'}, {'ORTH': '-'}, {'LOWER': 'напросто'}],
    [{'LOWER': 'нет'}, {'ORTH': '-'}, {'LOWER': 'нет'}],
    [{'LOWER': 'много'}, {'ORTH': '-'}, {'LOWER': 'много'}],
    [{'LOWER': 'строго'}, {'ORTH': '-'}, {'LOWER': 'настрого'}],
    [{'LOWER': 'тип'}, {'ORTH': '-'}, {'LOWER': 'топ'}],
    [{'LOWER': 'часто'}, {'ORTH': '-'}, {'LOWER': 'часто'}],
    [{'LOWER': 'шиворот'}, {'ORTH': '-'}, {'LOWER': 'навыворот'}],
    [{'LOWER': 'шито'}, {'ORTH': '-'}, {'LOWER': 'крыто'}],
    [{'LOWER': 'крепко'}, {'ORTH': '-'}, {'LOWER': 'накрепко'}],
    [{'LOWER': 'ладно'}, {'ORTH': '-'}, {'LOWER': 'ладно'}],
    [{'LOWER': 'видимо'}, {'ORTH': '-'}, {'LOWER': 'невидимо'}],
    [{'LOWER': 'день'}, {'ORTH': '-'}, {'LOWER': 'деньской'}],
    [{'LOWER': 'близко'}, {'ORTH': '-'}, {'LOWER': 'близко'}],
    [{'LOWER': 'крест'}, {'ORTH': '-'}, {'LOWER': 'накрест'}],
    [{'LOWER': 'туда'}, {'ORTH': '-'}, {'LOWER': 'обратно'}],
    [{'LOWER': 'долго'}, {'ORTH': '-'}, {'LOWER': 'долго'}],
    [{'LOWER': 'туда'}, {'ORTH': '-'}, {'LOWER': 'сюда'}],

]

INTERJECTION_PATTERNS = [
    [{'ORTH': 'кху'}, {'ORTH': '-'}, {'ORTH': 'кху'}, {'ORTH': '-'}, {'ORTH': 'кху'}],
    [{'ORTH': 'а'}, {'ORTH': '-'}, {'ORTH': 'а'}, {'ORTH': '-'}, {'ORTH': 'а'}, {'ORTH': '-'}, {'ORTH': 'а'}],
    [{'ORTH': 'хи'}, {'ORTH': '-'}, {'ORTH': 'хи'}, {'ORTH': '-'}, {'ORTH': 'хи'}],
    [{'ORTH': 'ха'}, {'ORTH': '-'}, {'ORTH': 'ха'}],
    [{'ORTH': 'хо'}, {'ORTH': '-'}, {'ORTH': 'хо'}],
    [{'ORTH': 'чик'}, {'ORTH': '-'}, {'ORTH': 'чик'}],
    [{'ORTH': 'тс'}, {'ORTH': '-'}, {'ORTH': 'с'}],
    [{'ORTH': 'м'}, {'ORTH': '-'}, {'ORTH': 'м'}],
    [{'ORTH': 'ту'}, {'ORTH': '-'}, {'ORTH': 'ту'}],
    [{'ORTH': 'та'}, {'ORTH': '-'}, {'ORTH': 'ра'}, {'ORTH': '-'}, {'ORTH': 'ри'}, {'ORTH': '-'}, {'ORTH': 'ри'},
     {'ORTH': '-'}, {'ORTH': 'ра'}],
    [{'ORTH': 'э'}, {'ORTH': '-'}, {'ORTH': 'эх'}],
    [{'ORTH': 'а'}, {'ORTH': '-'}, {'ORTH': 'а'}],
    [{'ORTH': 'ч'}, {'ORTH': '-'}, {'ORTH': 'ш'}, {'ORTH': '-'}, {'ORTH': 'ш'}, {'ORTH': '-'}, {'ORTH': 'ш'}],
    [{'ORTH': 'о'}, {'ORTH': '-'}, {'ORTH': 'о'}, {'ORTH': '-'}, {'ORTH': 'о'}],
    [{'ORTH': 'бляха'}, {'ORTH': '-'}, {'ORTH': 'муха'}],
    [{'ORTH': 'м'}, {'ORTH': '-'}, {'ORTH': 'да'}],
    [{'ORTH': 'тук'}, {'ORTH': '-'}, {'ORTH': 'тук'}],
    [{'ORTH': 'тьфу'}, {'ORTH': '-'}, {'ORTH': 'тьфу'}],
    [{'ORTH': 'ку'}, {'ORTH': '-'}, {'ORTH': 'ку'}],
    [{'ORTH': 'ей'}, {'ORTH': '-'}, {'ORTH': 'богу'}],
    [{'ORTH': 'а'}, {'ORTH': '-'}, {'ORTH': 'а'}, {'ORTH': '-'}, {'ORTH': 'а'}],
    [{'ORTH': 'кис'}, {'ORTH': '-'}, {'ORTH': 'кис'}],
    [{'ORTH': 'бу'}, {'ORTH': '-'}, {'ORTH': 'бу'}, {'ORTH': '-'}, {'ORTH': 'бу'}],
    [{'ORTH': 'тра'}, {'ORTH': '-'}, {'ORTH': 'та'}, {'ORTH': '-'}, {'ORTH': 'та'}],
    [{'ORTH': 'хе'}, {'ORTH': '-'}, {'ORTH': 'хе'}],
    [{'ORTH': 'хе'}, {'ORTH': '-'}, {'ORTH': 'хе'}, {'ORTH': '-'}, {'ORTH': 'хе'}],
    [{'ORTH': 'та'}, {'ORTH': '-'}, {'ORTH': 'та'}],
    [{'ORTH': 'м'}, {'ORTH': '-'}, {'ORTH': 'м'}, {'ORTH': '-'}, {'ORTH': 'м'}],
    [{'ORTH': 'ха'}, {'ORTH': '-'}, {'ORTH': 'ха'}, {'ORTH': '-'}, {'ORTH': 'ха'}],
    [{'ORTH': 'н'}, {'ORTH': '-'}, {'ORTH': 'да'}],
    [{'ORTH': 'ей'}, {'ORTH': '-'}, {'ORTH': 'ей'}],
    [{'ORTH': 'ого'}, {'ORTH': '-'}, {'ORTH': 'го'}],
    [{'ORTH': 'кхе'}, {'ORTH': '-'}, {'ORTH': 'ррр'}, {'ORTH': '-'}, {'ORTH': 'кхм'}],
    [{'ORTH': 'э'}, {'ORTH': '-'}, {'ORTH': 'э'}, {'ORTH': '-'}, {'ORTH': 'э'}],
    [{'ORTH': 'хо'}, {'ORTH': '-'}, {'ORTH': 'хо'}, {'ORTH': '-'}, {'ORTH': 'хо'}],
    [{'ORTH': 'ох'}, {'ORTH': '-'}, {'ORTH': 'хо'}, {'ORTH': '-'}, {'ORTH': 'хо'}],
    [{'ORTH': 'хи'}, {'ORTH': '-'}, {'ORTH': 'хи'}],
    [{'ORTH': 'ой'}, {'ORTH': '-'}, {'ORTH': 'ой'}, {'ORTH': '-'}, {'ORTH': 'ой'}],
    [{'ORTH': 'ай'}, {'ORTH': '-'}, {'ORTH': 'ай'}, {'ORTH': '-'}, {'ORTH': 'ай'}],
    [{'ORTH': 'ай'}, {'ORTH': '-'}, {'ORTH': 'яй'}, {'ORTH': '-'}, {'ORTH': 'яй'}],
    [{'ORTH': 'та'}, {'ORTH': '-'}, {'ORTH': 'ра'}, {'ORTH': '-'}, {'ORTH': 'ри'}, {'ORTH': '-'}, {'ORTH': 'ра'}],
    [{'ORTH': 'у'}, {'ORTH': '-'}, {'ORTH': 'у'}],
    [{'ORTH': 'да'}, {'ORTH': '-'}, {'ORTH': 'а'}, {'ORTH': '-'}, {'ORTH': 'а'}],
    [{'ORTH': 'р'}, {'ORTH': '-'}, {'ORTH': 'раз'}],
    [{'ORTH': 'та'}, {'ORTH': '-'}, {'ORTH': 'та'}, {'ORTH': '-'}, {'ORTH': 'та'}],
    [{'ORTH': 'да'}, {'ORTH': '-'}, {'ORTH': 'а'}],
    [{'ORTH': 'пиф'}, {'ORTH': '-'}, {'ORTH': 'паф'}],
    [{'ORTH': 'о'}, {'ORTH': '-'}, {'ORTH': 'о'}],
    [{'ORTH': 'ба'}, {'ORTH': '-'}, {'ORTH': 'бах'}],
    [{'ORTH': 'елки'}, {'ORTH': '-'}, {'ORTH': 'палки'}],
    [{'ORTH': 'ну'}, {'ORTH': '-'}, {'ORTH': 'у'}],
    [{'ORTH': 'тук'}, {'ORTH': '-'}, {'ORTH': 'тук'}, {'ORTH': '-'}, {'ORTH': 'тук'}],
    [{'ORTH': 'тьфу'}, {'ORTH': '-'}, {'ORTH': 'тьфу'}, {'ORTH': '-'}, {'ORTH': 'тьфу'}],
    [{'ORTH': 'ну'}, {'ORTH': '-'}, {'ORTH': 'ну'}],
    [{'ORTH': 'ч'}, {'ORTH': '-'}, {'ORTH': 'черт'}],
    [{'ORTH': 'э'}, {'ORTH': '-'}, {'ORTH': 'э'}],
    [{'ORTH': 'тик'}, {'ORTH': '-'}, {'ORTH': 'так'}],
    [{'ORTH': 'у'}, {'ORTH': '-'}, {'ORTH': 'у'}, {'ORTH': '-'}, {'ORTH': 'у'}],
    [{'ORTH': 'и'}, {'ORTH': '-'}, {'ORTH': 'и'}],
    [{'ORTH': 'буль'}, {'ORTH': '-'}, {'ORTH': 'буль'}],
    [{'ORTH': "ни"}, {'ORTH': "-"}, {'ORTH': "ни"}],
]

COMPOUND_PREPOSITION_PATTERNS = [
    [{'LOWER': "из"}, {'ORTH': "-"}, {}],
    [{'LOWER': "с"}, {'ORTH': "-"}, {'LOWER': "под"}],
    [{'LOWER': "для"}, {'ORTH': "-"}, {}],
    [{'LOWER': "за"}, {'ORTH': "-"}, {}],
]

PROPER_NAMES_WITH_DIGITS_PATTERNS = [
    # i.e ИЛ-2, T-34
    [{"IS_UPPER": True}, {'ORTH': "-"}, {"IS_DIGIT": True}],

]

COMPOUND_WORDS_WITH_DIGIT_PATTERNS = [
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "е"}],  # 1990-е
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "й"}],  # 1990-й
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "х"}],  # 2000-х
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "м"}],  # 2007-м
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "я"}],  # 2007-м
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "ти"}],  # 15-ти
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "го"}],  # 10-го
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "ого"}],  # 7-ого
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "му"}],  # 10-го
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "летие"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "летний"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "летних"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "летним"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "летней"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "летнего"}],

    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "летняя"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "летнюю"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "летие"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "летию"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "летия"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "процентный"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "процентная"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "процентное"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "дневный"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "дневная"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "дневное"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "дневные"}],
    [{"IS_DIGIT": True}, {'ORTH': "-"}, {'LOWER': "дневной"}],

]

GEOGRAPHIC_NAMES_PATTERNS = [
    # Following PATTERNS will match both nouns (i.e "Австро-Венгрия" and "Австро-венгерский")
    # prefixes
    # russian compound names
    [{'LOWER': "усть"}, {'ORTH': "-"}, {}],
    [{'LOWER': "соль"}, {'ORTH': "-"}, {}],
    [{'LOWER': "верх"}, {'ORTH': "-"}, {}],
    [{'LOWER': "старо"}, {'ORTH': "-"}, {}],
    [{'LOWER': "верхне"}, {'ORTH': "-"}, {}],
    [{'LOWER': "нижне"}, {'ORTH': "-"}, {}],
    [{'LOWER': "ново"}, {'ORTH': "-"}, {}],
    [{'LOWER': "свято"}, {'ORTH': "-"}, {}],
    # region names
    [{'LOWER': "австро"}, {'ORTH': "-"}, {}],
    [{'LOWER': "эльзас"}, {'ORTH': "-"}, {}],
    [{'LOWER': "москва"}, {'ORTH': "-"}, {}],
    # foreign articles
    [{'LOWER': "эль"}, {'ORTH': "-"}, {}],
    [{'LOWER': "аль"}, {'ORTH': "-"}, {}],
    [{'LOWER': "ле"}, {'ORTH': "-"}, {}],
    [{'LOWER': "ла"}, {'ORTH': "-"}, {}],
    [{'LOWER': "де"}, {'ORTH': "-"}, {}],
    [{'LOWER': "тель"}, {'ORTH': "-"}, {}],
    [{'LOWER': "порт"}, {'ORTH': "-"}, {}],
    [{'LOWER': "санкт"}, {'ORTH': "-"}, {}],
    [{'LOWER': "нью"}, {'ORTH': "-"}, {}],
    [{'LOWER': "лос"}, {'ORTH': "-"}, {}],
    [{'LOWER': "вест"}, {'ORTH': "-"}, {}],
    [{'LOWER': "ханты"}, {'ORTH': "-"}, {}],
    [{'LOWER': "кабардино"}, {'ORTH': "-"}, {}],
    [{'LOWER': "алма"}, {'ORTH': "-"}, {}],
    [{'LOWER': "лас"}, {'ORTH': "-"}, {}],
    [{'LOWER': "шри"}, {'ORTH': "-"}, {}],
    [{'LOWER': "коста"}, {'ORTH': "-"}, {}],
    # postfixes
    [{}, {'ORTH': "-"}, {'ORTH': "оол"}],
    [{}, {'ORTH': "-"}, {'ORTH': "Сити"}],
]

ORG_NAMES_PATTERNS = [
    [{}, {'ORTH': "-"}, {'LOWER': "групп"}],
    [{}, {'ORTH': "-"}, {'LOWER': "груп"}],

]

CONJUNCT_WORDS_PATTERNS = [
    # i.e. Ростов-на-Дону, Ортега-и-Гассет, Иван-да-Марья
    [{}, {'ORTH': "-"}, {'LOWER': "на"}, {'ORTH': "-"}, {}],
    [{}, {'ORTH': "-"}, {'LOWER': "да"}, {'ORTH': "-"}, {}],
    [{}, {'ORTH': "-"}, {'ORTH': "и"}, {'ORTH': "-"}, {}],
]

DIRECTION_PATTERNS = [
    # part of world
    [{'LOWER': "северо"}, {'ORTH': "-"}, {}],
    [{'LOWER': "юго"}, {'ORTH': "-"}, {}],
    [{'LOWER': "южно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "восточно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "западно"}, {'ORTH': "-"}, {}],
]

ADDRESS_PATTERNS = [
    [{'LOWER': "р"}, {'ORTH': "-"}, {'LOWER': "н"}],
]

MISC_HYPHEN_FORM_PATTERNS = [
    [{'LOWER': "б"}, {'ORTH': "-"}, {"IS_ALPHA": True}],  # i.e "слава б-гу" - used in web corpus by jewish
    [{'LOWER': "г"}, {'ORTH': "-"}, {"IS_ALPHA": True}],  # i.e "г-ну Иванову"
    [{'LOWER': "д"}, {'ORTH': "-"}, {"IS_ALPHA": True}],  # i.e "д-ру Иванову"
    [{'LOWER': "е"}, {'ORTH': "-"}, {"IS_ALPHA": True}],  # i.e "е-майл"
    [{}, {'ORTH': "-"}, {'LOWER': "кво"}],

]

LOANWORDS_PATTERNS = [
    # latin-, german- and greek-based prefixes (more traditional prefixes)
    [{'LOWER': "вице"}, {'ORTH': "-"}, {}],
    [{'LOWER': "обер"}, {'ORTH': "-"}, {}],
    [{'LOWER': "унтер"}, {'ORTH': "-"}, {}],
    [{'LOWER': "лейб"}, {'ORTH': "-"}, {}],
    [{'LOWER': "штаб"}, {'ORTH': "-"}, {}],
    [{'LOWER': "экс"}, {'ORTH': "-"}, {}],
    [{'LOWER': "контр"}, {'ORTH': "-"}, {}],
    [{'LOWER': "архи"}, {'ORTH': "-"}, {}],
    [{'LOWER': "альтер"}, {'ORTH': "-"}, {}],
    [{'LOWER': "форс"}, {'ORTH': "-"}, {}],
    [{'LOWER': "статс"}, {'ORTH': "-"}, {}],
    [{'LOWER': "микро"}, {'ORTH': "-"}, {}],
    [{'LOWER': "макро"}, {'ORTH': "-"}, {}],
    [{'LOWER': "кило"}, {'ORTH': "-"}, {}],
    [{'LOWER': "мега"}, {'ORTH': "-"}, {}],
    [{'LOWER': "гига"}, {'ORTH': "-"}, {}],
    [{'LOWER': "анти"}, {'ORTH': "-"}, {}],
    [{'LOWER': "квази"}, {'ORTH': "-"}, {}],
    [{'LOWER': "шеф"}, {'ORTH': "-"}, {}],
    [{'LOWER': "камер"}, {'ORTH': "-"}, {}],
    [{'LOWER': "альма"}, {'ORTH': "-"}, {}],
    [{'LOWER': "прима"}, {'ORTH': "-"}, {}],
    [{'LOWER': "ски"}, {'ORTH': "-"}, {}],
    [{'LOWER': "блиц"}, {'ORTH': "-"}, {}],
    # units
    [{'ORTH': 'киловатт'}, {'ORTH': '-'}, {}],

    # greek letters
    [{'LOWER': "альфа"}, {'ORTH': "-"}, {}],
    [{'LOWER': "бета"}, {'ORTH': "-"}, {}],
    [{'LOWER': "гамма"}, {'ORTH': "-"}, {}],
    [{'LOWER': "дельта"}, {'ORTH': "-"}, {}],
    [{'LOWER': "каппа"}, {'ORTH': "-"}, {}],
    [{'LOWER': "лямбда"}, {'ORTH': "-"}, {}],
    [{'LOWER': "сигма"}, {'ORTH': "-"}, {}],
    [{'LOWER': "тета"}, {'ORTH': "-"}, {}],
    [{'LOWER': "омега"}, {'ORTH': "-"}, {}],

    # english-based prefixes (more modern prefixes)
    [{'LOWER': "пресс"}, {'ORTH': "-"}, {}],
    [{'LOWER': "мини"}, {'ORTH': "-"}, {}],
    [{'LOWER': "макси"}, {'ORTH': "-"}, {}],
    [{'LOWER': "миди"}, {'ORTH': "-"}, {}],
    [{'LOWER': "vip"}, {'ORTH': "-"}, {}],
    [{'LOWER': "вип"}, {'ORTH': "-"}, {}],
    [{'LOWER': "it"}, {'ORTH': "-"}, {}],
    [{'LOWER': "ит"}, {'ORTH': "-"}, {}],
    [{'LOWER': "hi"}, {'ORTH': "-"}, {}],
    [{'LOWER': "хай"}, {'ORTH': "-"}, {}],
    [{'LOWER': "wi"}, {'ORTH': "-"}, {}],
    [{'LOWER': "вай"}, {'ORTH': "-"}, {}],
    [{'LOWER': "премьер"}, {'ORTH': "-"}, {}],
    [{'LOWER': "эконом"}, {'ORTH': "-"}, {}],
    [{'LOWER': "перпетуум"}, {'ORTH': "-"}, {}],
    [{'LOWER': "пит"}, {'ORTH': "-"}, {}],
    [{'LOWER': "кросс"}, {'ORTH': "-"}, {}],
    [{'LOWER': "тест"}, {'ORTH': "-"}, {}],
    [{'LOWER': "секс"}, {'ORTH': "-"}, {}],
    [{'LOWER': "стрип"}, {'ORTH': "-"}, {}],
    [{'LOWER': "хэдж"}, {'ORTH': "-"}, {}],
    [{'LOWER': "фокус"}, {'ORTH': "-"}, {}],
    [{'LOWER': "медиа"}, {'ORTH': "-"}, {}],
    [{'LOWER': "интернет"}, {'ORTH': "-"}, {}],
    [{'LOWER': "веб"}, {'ORTH': "-"}, {}],
    [{'LOWER': "арт"}, {'ORTH': "-"}, {}],
    [{'LOWER': "дот"}, {'ORTH': "-"}, {}],
    [{'LOWER': "топ"}, {'ORTH': "-"}, {}],
    [{'LOWER': "дресс"}, {'ORTH': "-"}, {}],
    [{'LOWER': "пин"}, {'ORTH': "-"}, {}],
    [{'LOWER': "шорт"}, {'ORTH': "-"}, {}],
    [{'LOWER': "лонг"}, {'ORTH': "-"}, {}],
    [{'LOWER': "продакт"}, {'ORTH': "-"}, {}],
    [{'LOWER': "супер"}, {'ORTH': "-"}, {}],
    [{'LOWER': "гипер"}, {'ORTH': "-"}, {}],
    [{'LOWER': "аудио"}, {'ORTH': "-"}, {}],
    [{'LOWER': "видео"}, {'ORTH': "-"}, {}],
    [{'LOWER': "поп"}, {'ORTH': "-"}, {}],
    [{'LOWER': "рок"}, {'ORTH': "-"}, {}],
    [{'LOWER': "панк"}, {'ORTH': "-"}, {}],
    [{'LOWER': "рэп"}, {'ORTH': "-"}, {}],
    [{'LOWER': "рэп"}, {'ORTH': "-"}, {}],
    [{'LOWER': "экспресс"}, {'ORTH': "-"}, {}],
    [{'LOWER': "блок"}, {'ORTH': "-"}, {}],
    [{'LOWER': "масс"}, {'ORTH': "-"}, {}],
    [{'LOWER': "шоу"}, {'ORTH': "-"}, {}],
    [{'LOWER': "офф"}, {'ORTH': "-"}, {}],
    [{'LOWER': "пиар"}, {'ORTH': "-"}, {}],
    [{'LOWER': "вич"}, {'ORTH': "-"}, {}],
    [{'LOWER': "гран"}, {'ORTH': "-"}, {}],
    [{'LOWER': 'уик'}, {'ORTH': '-'}, {}],
    [{'ORTH': 'луна'}, {'ORTH': '-'}, {}]
]

COMPOUND_NOUNS = [

    [{'LOWER': "генерал"}, {'ORTH': "-"}, {}],
    [{'LOWER': "социал"}, {'ORTH': "-"}, {}],
    [{'LOWER': "национал"}, {'ORTH': "-"}, {}],
    [{'LOWER': "серо"}, {'ORTH': "-"}, {}],
    [{'LOWER': "англо"}, {'ORTH': "-"}, {}],
    [{'LOWER': "матч"}, {'ORTH': "-"}, {}],
    [{'LOWER': "член"}, {'ORTH': "-"}, {}],
    [{'LOWER': "сверх"}, {'ORTH': "-"}, {}],
    [{'LOWER': "перво"}, {'ORTH': "-"}, {}],
    [{'LOWER': "псевдо"}, {'ORTH': "-"}, {}],
]

COMPOUND_ADJECTIVE_PATTERNS = [
    # [{"is_adjective": True}, {'ORTH': "-"}, {}],
    [{'LOWER': "черно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "идейно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "научно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "военно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "физико"}, {'ORTH': "-"}, {}],
    [{'LOWER': "общественно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "торгово"}, {'ORTH': "-"}, {}],
    [{'LOWER': "темно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "взаимно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "горно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "ярко"}, {'ORTH': "-"}, {}],
    [{'LOWER': "нормативно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "сердечно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "воздушно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "желудочно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "мрачно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "химико"}, {'ORTH': "-"}, {}],
    [{'LOWER': "административно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "организационно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "жилищно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "дорожно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "планово"}, {'ORTH': "-"}, {}],
    [{'LOWER': "взлетно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "судебно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "социально"}, {'ORTH': "-"}, {}],
    [{'LOWER': "духовно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "патрульно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "инженерно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "финансово"}, {'ORTH': "-"}, {}],
    [{'LOWER': "либерально"}, {'ORTH': "-"}, {}],
    [{'LOWER': "медико"}, {'ORTH': "-"}, {}],
    [{'LOWER': "природно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "программно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "светло"}, {'ORTH': "-"}, {}],
    [{'LOWER': "целлюлозно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "санитарно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "опытно"}, {'ORTH': "-"}, {}],
    [{'LOWER': "природно"}, {'ORTH': "-"}, {}],
    [{'ORTH': 'аварийно'}, {'ORTH': '-'}, {}],
    [{'ORTH': 'народно'}, {'ORTH': '-'}, {}],
    [{'ORTH': 'культурно'}, {'ORTH': '-'}, {}],
    [{'ORTH': 'учебно'}, {'ORTH': '-'}, {}],
    [{'ORTH': 'немецко'}, {'ORTH': '-'}, {}],
    [{'ORTH': 'причинно'}, {'ORTH': '-'}, {}],
    [{'ORTH': 'информационно'}, {'ORTH': '-'}, {}],
    [{'ORTH': 'ликеро'}, {'ORTH': '-'}, {}],
]

PUNCTUATION_PATTERNS = [
    [{'ORTH': "."}, {'ORTH': ".", 'OP': "+"}]
]
